uhnp/src/InformationRegisters/ПроектыСПЗ/ПроектыСПЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПроектыСПЗ</name>
  <resources>
    <name>Обеспечение</name>
    <type>
      <types>EnumRef.ВариантыВключенияПозицийПотребностей</types>
    </type>
  </resources>
  <resources>
    <name>ВключитьВ</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.ИдентификаторыСтрокПлановЗакупок</types>
    </type>
  </resources>
  <resources>
    <name>ОрганизацияЗаказчик</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ПредметДоговора</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ОбщиеТребования</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ЦФОИсполнитель</name>
    <type>
      <types>DefinedType.ЦФО</types>
    </type>
  </resources>
  <resources>
    <name>МестоПоставки</name>
    <type>
      <types>CatalogRef.МестаПоставки</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>ПериодПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоложениеОплаты</name>
    <type>
      <types>CatalogRef.ПоложениеОЗакупках</types>
    </type>
  </resources>
  <resources>
    <name>УИДУсловияОплаты</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>ЦентрализованныеЗакупки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодЗакупки</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИД</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/НастройкиПланированияЗакупочныхПроцедур/НастройкиПланированияЗакупочныхПроцедур.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПланированияЗакупочныхПроцедур</name>
  <resources>
    <name>МетодОценки</name>
    <type>
      <types>EnumRef.МетодыОценкиПредложенийПоставщиков</types>
    </type>
  </resources>
  <resources>
    <name>СрокПодготовки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДлительностьПроцедуры</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СпособЗакупки</name>
    <type>
      <types>EnumRef.СпособыВыбораПоставщика</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/ЭтапыПланированияПотребностей/ЭтапыПланированияПотребностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЭтапыПланированияПотребностей</name>
  <enumValues>
    <name>ЗаявкиНаЗакупку</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкиСогласованные</name>
  </enumValues>
  <enumValues>
    <name>БюджетЗакупокОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ЗакупочныеПроцедуры</name>
  </enumValues>
  <enumValues>
    <name>ВыбранПоставщик</name>
  </enumValues>
  <enumValues>
    <name>Законтрактовано</name>
  </enumValues>
  <enumValues>
    <name>ЗаказыПоставщикам</name>
  </enumValues>
  <enumValues>
    <name>Исполнено</name>
    <comment>Движений по этому разделу нет и не будет</comment>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВидЛотовойЗакупки/ВидЛотовойЗакупки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидЛотовойЗакупки</name>
  <enumValues>
    <name>ЛотоваяЗакупка</name>
  </enumValues>
  <enumValues>
    <name>ПопозиционнаяЗакупка</name>
  </enumValues>
  <enumValues>
    <name>Зонтичная</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/МетодыОценкиПредложенийПоставщиков/МетодыОценкиПредложенийПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МетодыОценкиПредложенийПоставщиков</name>
  <enumValues>
    <name>ПоЦенам</name>
  </enumValues>
  <enumValues>
    <name>ПоКритериям</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ПорядокРасчетов/ПорядокРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПорядокРасчетов</name>
  <enumValues>
    <name>ПоДоговорамКонтрагентов</name>
  </enumValues>
  <enumValues>
    <name>ПоЗаказам</name>
  </enumValues>
  <enumValues>
    <name>ПоДоговорамНакладным</name>
  </enumValues>
  <enumValues>
    <name>ПоЗаказамНакладным</name>
  </enumValues>
  <enumValues>
    <name>ПоНакладным</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/СпособыВыбораПоставщика/СпособыВыбораПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СпособыВыбораПоставщика</name>
  <attributes>
    <name>СпособыВыбораПоставщика</name>
    <type>
      <types>EnumRef.СпособыВыбораПоставщика</types>
    </type>
  </attributes>
  <attributes>
    <name>ТиповойСпособ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МСП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МСПСубПодряд</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Конкурентный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяФорма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МногоэтапныйСпособ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗакрытыйСпособ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонМероприятий</name>
    <type>
      <types>CatalogRef.ШаблоныМероприятий</types>
    </type>
  </attributes>
  <attributes>
    <name>КодЕИС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеЕИС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/Catalogs/ТоварныеКатегории/ТоварныеКатегории.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТоварныеКатегории</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ВидыНоменклатуры</owners>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>DefinedType.ТипЕдиницаИзмеренияЕХ</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОКВЭД2</name>
    <type>
      <types>CatalogRef.КлассификаторОКВЭД2</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСтавкаНДС</name>
    <comment> Ставка НДС по умолчанию для оформления документов</comment>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтавкиНДС</name>
    <type>
      <types>EnumRef.ВидыСтавокНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОКПД2</name>
    <type>
      <types>CatalogRef.КлассификаторОКПД2</types>
    </type>
  </attributes>
  <attributes>
    <name>ФункциональноеНаправление</name>
    <type>
      <types>CatalogRef.ФункциональныеНаправления</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Catalogs/КатегорииЗакупок/КатегорииЗакупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КатегорииЗакупок</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>DefinedType.ТипЕдиницаИзмеренияЕХ</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОКВЭД2</name>
    <type>
      <types>CatalogRef.КлассификаторОКВЭД2</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСтавкаНДС</name>
    <comment> Ставка НДС по умолчанию для оформления документов</comment>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтавкиНДС</name>
    <type>
      <types>EnumRef.ВидыСтавокНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОКПД2</name>
    <type>
      <types>CatalogRef.КлассификаторОКПД2</types>
    </type>
  </attributes>
  <attributes>
    <name>ФункциональноеНаправление</name>
    <type>
      <types>CatalogRef.ФункциональныеНаправления</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/CommonModules/ПомощникПланированияСерверВстраивание/Module.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СобытияФормы
	
Процедура ПриСозданииНаСервере(Форма) Экспорт

    Форма.Элементы.ТоварныеКатегории.Заголовок = НСтр("ru = 'Категории закупки'");
	
	Форма.Элементы.КомандаУправлениеАналогами.Заголовок = НСтр("ru = 'Управление аналогами и унификатами'"); 
	Форма.Элементы.КомандаСписокАналогов.Видимость 		= Ложь;  
	Форма.Элементы.КомандаСписокУнификатов.Видимость 	= Ложь;      
	
	Форма.Элементы.КорзинаПроектыСПЗТоварнаяКатегория1.Заголовок = НСтр("ru = 'Категория закупок'");
	//
	МодифицироватьСписокПотребностей(Форма);

КонецПроцедуры           

Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Форма, Настройки) Экспорт    
	
	МодифицироватьСписокПотребностей(Форма);

КонецПроцедуры

#КонецОбласти   

#Область ДляВызоваИзСвязанныхОбъектов 

Функция СформироватьСПЗНаОснованииПроекта(Знач СтруктураПроектаСПЗ) Экспорт
	
	Перем ДатаМаксимум, ДатаМинимум, ДатыПоставки, ДлительностиПодготовки, ДлительностиПроцедуры, ДлительностьПодготовки, ДлительностьПроцедуры, Док, НачалоЗакупок;
	
	Док = Документы.СтрокаПланаЗакупок.СоздатьДокумент();
	Док.Дата = ТекущаяДатаСеанса();
	Док.ЦенаВключаетНДС = Истина;   
	
	ТаблицаВалюты = СтруктураПроектаСПЗ.Позиции.Скопировать(, "Валюта");
	ТаблицаВалюты.Свернуть("Валюта");    
	Если ТаблицаВалюты.Количество()=1 Тогда 
		Док.ВалютаДокумента = ТаблицаВалюты[0].Валюта;
	Иначе
		ВызватьИсключение Нстр("ru = 'Неоднозначное определение валюты документа. Черновик содержит потребности с разной валютой'");	
	КонецЕсли;
	
	Док.Номенклатура.Загрузить(СтруктураПроектаСПЗ.Позиции);    
	Док.Заполнить(СтруктураПроектаСПЗ.ДанныеЗаполнения);
	Если Константы.РазделятьНоменклатуруПоКатегорийнымМенеджерам.Получить() Тогда
		УстановитьТоварнуюКатегорию(Док);
	Иначе
		// Не требуется принудительная установка товарной категории.
	КонецЕсли;
	//Док.ЕдиноеМестоПоставки = СтруктураПроектаСПЗ.ДанныеЗаполнения.ЕдиноеМестоПоставки;
	Док.ПорядокФормированияЦеныДоговора = ".";
	Док.УсловиеОплаты = СтруктураПроектаСПЗ.ДанныеЗаполнения.УсловияОплаты;	  
	
	//Параметры оплаты
	УстановитьПараметрыОплатыДокументаПоПроекту(Док, СтруктураПроектаСПЗ);
	
	Док.Раздел = Перечисления.ЭтапыПланированияПотребностей.ЗакупочныеПроцедуры;     
	
	ДлительностиПодготовки = СтруктураПроектаСПЗ.Параметры.НайтиСтроки(Новый Структура("Свойство", ПланыВидовХарактеристик.ПараметрыЗакупки.ДлительностьПодготовки)); 
	Если ДлительностиПодготовки.Количество() Тогда
		ДлительностьПодготовки =  ДлительностиПодготовки[0].Значение;
	Иначе
		ВызватьИсключение Нстр("ru = 'Необходимо указать способ закупки'");
	КонецЕсли;  
	ДлительностиПроцедуры = СтруктураПроектаСПЗ.Параметры.НайтиСтроки(Новый Структура("Свойство", ПланыВидовХарактеристик.ПараметрыЗакупки.ДлительностьПроцедуры)); 
	Если ДлительностиПроцедуры.Количество() Тогда
		ДлительностьПроцедуры =  ДлительностиПроцедуры[0].Значение;
	Иначе
		ВызватьИсключение Нстр("ru = 'Необходимо указать способ закупки'");
	КонецЕсли;    
	
	ДатыПоставки = СтруктураПроектаСПЗ.Позиции.Скопировать(, "ДатаПоставки");       
	ДатыПоставки.Сортировать("ДатаПоставки Возр"); 
	ДатаМинимум = ДатыПоставки[0].ДатаПоставки;
	ДатаМаксимум = ДатыПоставки[ДатыПоставки.Количество()-1].ДатаПоставки;  
	НачалоЗакупок = Макс(ТекущаяДата(), НачалоГода(ДатаМинимум));  
	
	Док.ДатаНачалаПодготовкиЗакупки 		= Макс(ДатаМинимум-ДлительностьПодготовки*24*60*60, НачалоЗакупок);
	Док.ДатаИсполненияДоговора 				= КонецГода(ДатаМаксимум);
	Док.ДатаОфициальногоОбъявленияЗакупки 	= Макс(ДатаМинимум-ДлительностьПроцедуры*24*60*60, НачалоЗакупок);  
	
	РассчитатьСуммыНДССтрок(Док);
	
	Сумма = Док.Номенклатура.Итог("Сумма");    
	Если Сумма <> 0 Тогда
		ИтогСуммаНДС = Док.Номенклатура.Итог("СуммаНДС");
		КоэффициентНДС = ИтогСуммаНДС / Сумма;
		Док.СуммаНДС = КоэффициентНДС * Док.СуммаДокумента;
	Иначе
		СуммаНДС = 0;
	КонецЕсли;
	
	Док.Записать(РежимЗаписиДокумента.Проведение);
	Возврат Док;

КонецФункции

Процедура РассчитатьСуммыНДССтрок(Знач Док)
	
	Перем СоответствиеСтавок, СтавкиНДСТаблица, СтрокаНоменклатура, ТекСтавкаНдсЧисло;
	
	СтавкиНДСТаблица = Док.Номенклатура.Выгрузить(, "СтавкаНДС"); 
	СтавкиНДСТаблица.Свернуть("СтавкаНДС"); 
	СоответствиеСтавок = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(СтавкиНДСТаблица.ВыгрузитьКолонку("СтавкаНДС"), "Ставка"); 
	Для Каждого СтрокаНоменклатура Из Док.Номенклатура Цикл      
		ТекСтавкаНдсЧисло = СоответствиеСтавок.Получить(СтрокаНоменклатура.СтавкаНДС);
		СтрокаНоменклатура.СуммаНДС = УчетНДСКлиентСервер.РассчитатьСуммуНДС(СтрокаНоменклатура.Сумма, Док.ЦенаВключаетНДС, ТекСтавкаНдсЧисло);
	КонецЦикла;

КонецПроцедуры        

Функция НаОснованииПроектаСПЗС_СформироватьЛот(СтруктураПроектаСПЗ) Экспорт
	
	///////	                 
		СпособыЗакупки = СтруктураПроектаСПЗ.Параметры.НайтиСтроки(Новый Структура("Свойство", ПланыВидовХарактеристик.ПараметрыЗакупки.СпособЗакупки)); 
		Если СпособыЗакупки.Количество() Тогда
			СпособЗакупки =  СпособыЗакупки[0].Значение;
		Иначе
			ВызватьИсключение Нстр("ru = 'Необходимо указать способ закупки'");
		КонецЕсли;       
		ДлительностиПодготовки = СтруктураПроектаСПЗ.Параметры.НайтиСтроки(Новый Структура("Свойство", ПланыВидовХарактеристик.ПараметрыЗакупки.ДлительностьПодготовки)); 
		Если ДлительностиПодготовки.Количество() Тогда
			ДлительностьПодготовки =  ДлительностиПодготовки[0].Значение;
		Иначе
			ВызватьИсключение Нстр("ru = 'Необходимо указать способ закупки'");
		КонецЕсли;  
		ДлительностиПроцедуры = СтруктураПроектаСПЗ.Параметры.НайтиСтроки(Новый Структура("Свойство", ПланыВидовХарактеристик.ПараметрыЗакупки.ДлительностьПроцедуры)); 
		Если ДлительностиПроцедуры.Количество() Тогда
			ДлительностьПроцедуры =  ДлительностиПроцедуры[0].Значение;
		Иначе
			ВызватьИсключение Нстр("ru = 'Необходимо указать способ закупки'");
		КонецЕсли;    
		
		ДатыПоставки = СтруктураПроектаСПЗ.Позиции.Скопировать(, "ДатаПоставки");       
		ДатыПоставки.Сортировать("ДатаПоставки Возр"); 
		ДатаМинимум = ДатыПоставки[0].ДатаПоставки;
		ДатаМаксимум = ДатыПоставки[ДатыПоставки.Количество()-1].ДатаПоставки;  
		НачалоЗакупок = Макс(ТекущаяДата(), НачалоГода(ДатаМинимум));
		
		ПараметрыВыбораПоставщика = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СпособЗакупки, "СпособыВыбораПоставщика, ЗакрытыйСпособ, ЭлектроннаяФорма");  
		
		Валюты = СтруктураПроектаСПЗ.Позиции.Скопировать(, "Валюта");
		Валюты.Свернуть("Валюта");
		Если Валюты.Количество()=1 Тогда
			ОтборВалюта = Валюты[0].Валюта;
		Иначе
			ВызватьИсключение Нстр("ru = 'Неоднозначное определение валюты потребностей. В документе должна быть только одна валюта'"); 
		КонецЕсли;
	
		ЗакупочнаяПроцедура = Справочники.ЗакупочныеПроцедуры.СоздатьЭлемент();
		ЗакупочнаяПроцедура.УстановитьНовыйКод(); 
		
		ЗакупочнаяПроцедура.ВалютаДокумента 			= ОтборВалюта;
		ЗакупочнаяПроцедура.ПриобретениеФинансовыхУслуг = Ложь;
		ЗакупочнаяПроцедура.ПериодЗакупок				= СтруктураПроектаСПЗ.ПериодЗакупки;
		ЗакупочнаяПроцедура.ОрганизаторЗакупки			= СтруктураПроектаСПЗ.ОрганизацияЗаказчик;
		ЗакупочнаяПроцедура.ОрганизацияДляЗаключенияДоговора	= СтруктураПроектаСПЗ.ОрганизацияЗаказчик;
		ЗакупочнаяПроцедура.СпособВыбораПоставщика		= СпособЗакупки;
		ЗакупочнаяПроцедура.ЗакрытаяЗакупка 			= ПараметрыВыбораПоставщика.ЗакрытыйСпособ;
		ЗакупочнаяПроцедура.ВЭлектроннойФорме 			= ПараметрыВыбораПоставщика.ЭлектроннаяФорма;
		ЗакупочнаяПроцедура.КоличествоМестСОбязанностьюЗаключитьДоговор = 2;
		
		ЗакупочнаяПроцедура.Наименование				= Нстр("ru = 'Закупочные процедуры '")+ ЗакупочнаяПроцедура.Код;
		ЗакупочнаяПроцедура.ПредметДоговора				= "< Уточните предмет договора >"; 
		ЗакупочнаяПроцедура.ОбщиеТребования				= СтруктураПроектаСПЗ.ОбщиеТребования;
		ЗакупочнаяПроцедура.МинимальноеКоличествоЗаявок = 2;    
		
		ЗакупочнаяПроцедура.ДатаНачалаПериодаПоставки 		= ДатаМинимум;
		ЗакупочнаяПроцедура.ДатаОкончанияПериодаПоставки 	= ДатаМаксимум; 
		ЗакупочнаяПроцедура.ДатаОфициальногоОбъявленияЗакупки = Макс(ДатаМинимум-ДлительностьПроцедуры*24*60*60, НачалоЗакупок); 		
		ЗакупочнаяПроцедура.ДатаНачалаПодготовкиЗакупки		= Макс(ДатаМинимум-ДлительностьПодготовки*24*60*60, НачалоЗакупок);      
		
		УстановитьПараметрыОплатыДокументаПоПроекту(ЗакупочнаяПроцедура, СтруктураПроектаСПЗ);    
		
		МестаПоставкиТаблица = СтруктураПроектаСПЗ.Позиции.Скопировать(, "МестоПоставки"); 
		МестаПоставкиТаблица.Свернуть("МестоПоставки"); 
		
		ЗакупочнаяПроцедура.Записать();    
		
		ДокументЛот 		= Документы.Лот.СоздатьДокумент(); 
		ДокументЛот.Дата 	= ТекущаяДатаСеанса();                    
		ДокументЛот.ЦенаВключаетНДС 			= Истина;
        ДокументЛот.ЗакупочнаяПроцедура 		= ЗакупочнаяПроцедура.Ссылка; 
		ДокументЛот.ПриобретениеФинансовыхУслуг	= ЗакупочнаяПроцедура.ПриобретениеФинансовыхУслуг; 
		ДокументЛот.ВидЗакупки					= Перечисления.ВидЛотовойЗакупки.ЛотоваяЗакупка;
		ДокументЛот.ВалютаДокумента						= ОтборВалюта;  
		ДокументЛот.ПериодЗакупок						= СтруктураПроектаСПЗ.ПериодЗакупки; 
		ДокументЛот.ОрганизацияДляЗаключенияДоговора	= СтруктураПроектаСПЗ.ОрганизацияЗаказчик;
   		ДокументЛот.МетодОценкиПредложенийПоставщиков 	= МетодОценкиПоСпособуЗакупки(СпособЗакупки);
		ДокументЛот.ЗапретПревышенияНМЦ					= Истина;      
		ДокументЛот.ПредметДоговора				= "< Уточните предмет договора >"; 
		ДокументЛот.ОбщиеТребования				= СтруктураПроектаСПЗ.ОбщиеТребования; 
		ДокументЛот.ЕдиноеМестоПоставки 		= МестаПоставкиТаблица.Количество() = 1;
		
		Для Каждого ПозицияПотребностей Из СтруктураПроектаСПЗ.Позиции Цикл 
			ПараметрыНоменклатуры = ДокументЛот.Номенклатура.Добавить();
			ЗаполнитьЗначенияСвойств(ПараметрыНоменклатуры, ПозицияПотребностей);
		КонецЦикла;  
		
		УстановитьПараметрыОплатыДокументаПоПроекту(ДокументЛот, СтруктураПроектаСПЗ);
		
		ОбщаяСумма = 0;
		ОбщаяСуммаПроцентов = 0; 
		
		ДатаПривлечения 	= Неопределено;
		ДатаВозврата		= Неопределено; 
		ПроцентнаяСтавка	= Неопределено;
		ДокументЛот.ДатаПривлечения    	= ДатаПривлечения;
		ДокументЛот.ДатаВозврата	    = ДатаВозврата;
		ДокументЛот.СуммаПривлечения 	= ОбщаяСумма; 
		СуммаПроцентов					= ОбщаяСуммаПроцентов;
		ДокументЛот.ПроцентнаяСтавка	= ПроцентнаяСтавка;  
		
		РассчитатьСуммыНДССтрок(ДокументЛот);   
		
		Сумма = ДокументЛот.Номенклатура.Итог("Сумма");    
		Если Сумма <> 0 Тогда
			ИтогСуммаНДС = ДокументЛот.Номенклатура.Итог("СуммаНДС");
			ДокументЛот.СуммаНДС = ИтогСуммаНДС;
		Иначе
			СуммаНДС = 0;
		КонецЕсли;

			
		Документы.Лот.РассчитатьСуммуПроцентов(ДокументЛот);
		ДокументЛот.Записать(РежимЗаписиДокумента.Проведение);  
		
		РегистрыСведений.ПроектыСПЗ.СохранитьПроектВИстории(СтруктураПроектаСПЗ, ДокументЛот.Ссылка);
		РегистрыСведений.ПроектыСПЗ.УдалитьПроектСПЗ(СтруктураПроектаСПЗ.Автор, СтруктураПроектаСПЗ.ПериодЗакупки, СтруктураПроектаСПЗ.ИД);
		
	/////  
	
	Возврат ДокументЛот;
	
КонецФункции

Функция МетодОценкиПоСпособуЗакупки(СпособЗакупки)
	
	Перем ВыборкаДетальныеЗаписи, Запрос, МетодОценкиПредложенийПоставщиков, РезультатЗапроса;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиПланированияЗакупочныхПроцедур.МетодОценки КАК МетодОценки,
	|	НастройкиПланированияЗакупочныхПроцедур.СрокПодготовки КАК СрокПодготовки,
	|	НастройкиПланированияЗакупочныхПроцедур.ДлительностьПроцедуры КАК ДлительностьПроцедуры
	|ИЗ
	|	РегистрСведений.НастройкиПланированияЗакупочныхПроцедур КАК НастройкиПланированияЗакупочныхПроцедур
	|ГДЕ
	|	НастройкиПланированияЗакупочныхПроцедур.СпособЗакупки В
	|			(ВЫБРАТЬ
	|				СпособыВыбораПоставщикаСправочник.СпособыВыбораПоставщика КАК СпособыВыбораПоставщика
	|			ИЗ
	|				Справочник.СпособыВыбораПоставщика КАК СпособыВыбораПоставщикаСправочник
	|			ГДЕ
	|				СпособыВыбораПоставщикаСправочник.Ссылка = &СпособВыбораПоставщика
	|		
	|			ОБЪЕДИНИТЬ ВСЕ
	|		
	|			ВЫБРАТЬ
	|				&СпособВыбораПоставщика)";
	
	Запрос.УстановитьПараметр("СпособВыбораПоставщика", СпособЗакупки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		МетодОценкиПредложенийПоставщиков 	= ВыборкаДетальныеЗаписи.МетодОценки; 
	Иначе
		МетодОценкиПредложенийПоставщиков 	= Перечисления.МетодыОценкиПредложенийПоставщиков.ПоКритериям;	
	КонецЕсли;         
	
	Возврат МетодОценкиПредложенийПоставщиков;

КонецФункции


Процедура УстановитьПараметрыОплатыДокументаПоПроекту(Знач Док, Знач СтруктураПроектаСПЗ) Экспорт
	
	Перем НоваяСтрока, ТекСтрока, ЭтапыОплаты;   
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Календарь", Док.Метаданные()) Тогда

		Док.Календарь	= СтруктураПроектаСПЗ.ПараметрыОплаты.КалендарьГрафика; 
		
	КонецЕсли;
	
	Если Док.Метаданные().ТабличныеЧасти.Найти("ЭтапыГрафикаОплаты") <> Неопределено Тогда     
		
		ЭтапыОплаты 	= СтруктураПроектаСПЗ.ПараметрыОплаты.ЭтапыГрафикаОплаты;
		Док.ЭтапыГрафикаОплаты.Очистить();  
		Если ЭтапыОплаты <> Неопределено Тогда
			Для Каждого ТекСтрока Из ЭтапыОплаты Цикл
				НоваяСтрока = Док.ЭтапыГрафикаОплаты.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			КонецЦикла;     
		КонецЕсли;    
		
	КонецЕсли;   
	
	Если Док.Метаданные().ТабличныеЧасти.Найти("ПланОплаты") <> Неопределено Тогда
		ЗаполнитьПланОплатСПЗНаСервере(Док);  
	КонецЕсли;

КонецПроцедуры   

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	
// Устанавливает в шапку документа ДокИзм товарную категорию, исходя из табличной 
// части номенклатуры.
Процедура УстановитьТоварнуюКатегорию(ДокИзм)
	Если ТипЗнч(ДокИзм) = Тип("ДокументОбъект.СтрокаПланаЗакупок") Тогда
		// Получим заполненную таблицу номенклатуры.
		ПустаяКатегория = Справочники.ТоварныеКатегории.ПустаяСсылка();
		Выгрузка = ДокИзм.Номенклатура.Выгрузить();
		// Добавим колонку Товарная категрия.
		Выгрузка.Колонки.Добавить("ТоварнаяКатегория");
		Для Каждого ТекВыгрузка Из Выгрузка Цикл
			ТекНоменклатура = ТекВыгрузка.Номенклатура;
			Если ЗначениеЗаполнено(ТекНоменклатура) и типзнч(ТекНоменклатура)=тип("СправочникСсылка.ТоварныеКатегории")  Тогда
				ТекВыгрузка.ТоварнаяКатегория = ТекНоменклатура;
			Иначе
				ТекВыгрузка.ТоварнаяКатегория = ПустаяКатегория;
			КонецЕсли;
		КонецЦикла;	
		// Если категория уникальна - запишем её в шапку.
		МассивКатегорий = Выгрузка.ВыгрузитьКолонку("ТоварнаяКатегория");
		МассивКатегорий = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивКатегорий);
		Если МассивКатегорий.Количество() = 1 Тогда
			ДокИзм.ТоварнаяКатегория = МассивКатегорий[0];
		Иначе
			// Не удалось однозначно определить товарную категорию.  не записываем в шапку.
		КонецЕсли;
	Иначе
		// Неизвестный вариант. Пропускаем.
	КонецЕсли;
КонецПроцедуры		// УстановитьТоварнуюКатегорию()

Процедура МодифицироватьСписокПотребностей(Знач Форма)   
	
	Форма.СписокПотребности.ТекстЗапроса = МодифицироватьЗапросПоКатегорийнымМенеджерам(Форма.СписокПотребности.ТекстЗапроса); 
	
	Форма.СписокПотребности.Параметры.УстановитьЗначениеПараметра("Автор", ПараметрыСеанса.ТекущийПользователь);

КонецПроцедуры

Функция МодифицироватьЗапросПоКатегорийнымМенеджерам(ТекстЗапроса) Экспорт
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,																				
								"ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ДанныеРегистра.АналитикаПланирования.АналитикаНоменклатуры.Номенклатура КАК Справочник.Номенклатура).ТоварнаяКатегория, ЗНАЧЕНИЕ(Справочник.ТоварныеКатегории.ПустаяСсылка))",																				
								"ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ДанныеРегистра.АналитикаПланирования.АналитикаНоменклатуры.Номенклатура КАК Справочник.Номенклатура).КатегорияЗакупок, ЗНАЧЕНИЕ(Справочник.КатегорииЗакупок.ПустаяСсылка))");																				
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,																				
								"ИНАЧЕ ВЫРАЗИТЬ(ДанныеРегистра.АналитикаПланирования.АналитикаНоменклатуры.Номенклатура КАК Справочник.ТоварныеКатегории)",																				
								"ИНАЧЕ ВЫРАЗИТЬ(ДанныеРегистра.АналитикаПланирования.АналитикаНоменклатуры.Номенклатура КАК Справочник.КатегорииЗакупок)");																				
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
								"&УсловиеМенеджерАвтор",
								"ПолномочияКатегорийныхМенеджеров.Менеджер = &Автор");   
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
								"&ПараметрАвтор",
								"&Автор");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
								"&УсловиеПараметрыЗакупкиАвтор",
								"ПараметрыЗакупкиПотребностей1.Автор = &Автор"); 
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
								"И ПолномочияКатегорийныхМенеджеров.ТоварнаяКатегория ССЫЛКА Справочник.ТоварныеКатегории",
								"И ПолномочияКатегорийныхМенеджеров.ТоварнаяКатегория ССЫЛКА Справочник.КатегорииЗакупок");
	Возврат ТекстЗапроса;

КонецФункции

Процедура ЗаполнитьПланОплатСПЗНаСервере(Док)  
	
	Если Док.ЭтапыГрафикаОплаты.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли;	
	Док.ПланОплаты.Очистить();
	ПланОплаты = Док.ПланОплаты.Выгрузить();
	ПланОплатыКопия = ПланОплаты.Скопировать();
	ШаблонГрафика = Док.ЭтапыГрафикаОплаты;
	Календарь = Док.Календарь;
	
	СуммаПлатежей = 0;
	СуммаОтгрузок = 0;
	Для каждого Период Из Док.Номенклатура Цикл
		
		
		ПланОплатыКопия.Очистить();
		
		СуммаОплатыКраспределению = Период.Сумма;
		
		ПараметрыЗаполнения = ЭтапыОплатыСервер.ПараметрыЗаполненияЭтаповОплаты();
		ПараметрыЗаполнения.ЭтоРасчетыСКлиентами = Ложь;
		ПараметрыЗаполнения.НакладнаяПоЗаказам = Ложь;
		ПараметрыЗаполнения.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказам;
		ПараметрыЗаполнения.ЭтоЗаказ = Ложь;
		ПараметрыЗаполнения.ЕстьДатаПереходаПраваСобственности = Ложь;
		
		ПараметрыЗаполнения.Вставить("ДатаОтгрузки", Период.ДатаПоставки);
		ПараметрыЗаполнения.Вставить("ДатаЗаказа", Период.ДатаПоставки);
		ПараметрыЗаполнения.Вставить("ШаблонГрафика", ШаблонГрафика);
		ПараметрыЗаполнения.Вставить("Календарь", Календарь.ПроизводственныйКалендарь);
		ПараметрыЗаполнения.Вставить("СуммаОплаты", СуммаОплатыКраспределению);
		
		ЭтапыОплатыСервер.ЗаполнитьЭтапыОплатыДокументаПоШаблону(ПланОплатыКопия, ПараметрыЗаполнения);
		
		Для каждого ЭтапОплаты Из ПланОплатыКопия Цикл
			
			НовСтр = ПланОплаты.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр,ЭтапОплаты);
			НовСтр.СтатьяБюджета = Период.СтатьяБюджета;
			НовСтр.Аналитика1 = Период.Аналитика1;
			НовСтр.Аналитика2 = Период.Аналитика2;
			НовСтр.Аналитика3 = Период.Аналитика3;
			НовСтр.Аналитика4 = Период.Аналитика4;
			НовСтр.Аналитика5 = Период.Аналитика5;
			НовСтр.Аналитика6 = Период.Аналитика6;
			
			НовСтр.ДатаПоступления = Период.ДатаПоставки;
			
		КонецЦикла; 
		
	КонецЦикла; 

	ПланОплаты.Свернуть("ПроцентПлатежа,СтатьяБюджета,Аналитика1,Аналитика2,Аналитика3,Аналитика4,Аналитика5,Аналитика6,ВариантОплаты, ДатаПлатежа, ДатаПоступления, Замещен","СуммаПлатежа, СуммаЗадолженности, СуммаОтгрузок");
	ПланОплаты.Колонки.Добавить("СуммаПлатежей");
	ПланОплаты.Сортировать("ДатаПлатежа,ДатаПоступления,СтатьяБюджета");
	
	Док.ПланОплаты.Загрузить(ПланОплаты);
	
КонецПроцедуры
#КонецОбласти

#КонецЕсли
